public class Main {
    public static void main(String[] args) {
        Car car0001 = new Car(1,true,2500);//взяли битую тачку
        car0001.rePainting("white");//перекрасили
        car0001.sold(3200);//сбагрили "Егору"
        car0001.carInfo();//хорошее начало бизнеса;)
        car0001.soldCarInfo();//инфа по проданной тачке
        car0001.inStock();//проверка наличия на складе, может сама ушла или прокралась обратно

        Car car0002 = new Car();//создаём тачку конструктором по умолчанию и проверяем работу конструктора
        Car car0003 = new Car(3,8400,"Cheburatti","onlyOne","Grey");/*
        создаём тачку при помощи конструктора с параметром и проверяем его работу*/
        car0002.damageCar();//разбиваем еще одну тачку
        car0002.damage();//проверка на бита/не бита 0002
        car0003.damage();//проверка на бита/не бита 0003
        car0002.sold(9000);//сбагрили "Егору2"
        car0002.soldCarInfo();//смотрим инфу по проданным тачкам
        car0003.soldCarInfo();//смотрим инфу по проданным тачкам



    }
}
